backend/app/controllers/api/exports_controller.rb

SELECT "surveys".* FROM "surveys"
---
  def csv
    @surveys = Survey.all

    csv_data = CSV.generate(headers: true) do |csv|
      csv << ['学籍番号', '問1', '問2', '問3', '問4', '問5', '作成日時']

      @surveys.each do |survey|