backend/app/controllers/api/surveys_controller.rb

  def create
    @survey = Survey.new(survey_params)

    if @survey.save
---
INSERT INTO "surveys" ("student_id", "question1", "question2", "question3", "question4", "question5", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"